In [1]:
import pandas as pd
import numpy as np

In [15]:
df_ventas = pd.read_csv('ventas_python.csv', encoding='latin1')

In [17]:
df_ventas.head(5)

,ID_Venta,Fecha,Cliente,Producto,Categoría,Cantidad,Precio_Unitario,Total,Forma_Pago,Empleado
0,1,01/06/2025,Juan Pérez,Laptop,Electrónica,1,12000,12000,Tarjeta de crédito,Ana Gómez
1,2,02/06/2025,Marta Díaz,Audífonos,Electrónica,2,850,1700,Efectivo,Roberto Torres
2,3,03/06/2025,Luis Méndez,Camiseta,Ropa,3,250,750,Transferencia,Lucía Romero
3,4,03/06/2025,Carmen Ruiz,Refrigerador,Electrodomésticos,1,9200,9200,Tarjeta de débito,Ana Gómez
4,5,04/06/2025,Pablo Ortiz,Tenis,Ropa,2,650,1300,Efectivo,Lucía Romero

In [26]:
df_ventas[['Producto', 'Precio_Unitario']]

       Producto  Precio_Unitario
0        Laptop            12000
1     Audífonos              850
2      Camiseta              250
3  Refrigerador             9200
4         Tenis              650
5       Celular             7800
6     Licuadora             1200
7         Jeans              400
8        Tablet             5400
9       Zapatos              950

In [31]:
df_ventas['Fecha'] = pd.to_datetime(df_ventas['Fecha'])

df_ventas.head(5)

,ID_Venta,Fecha,Cliente,Producto,Categoría,Cantidad,Precio_Unitario,Total,Forma_Pago,Empleado
0,1,2025-01-06,Juan Pérez,Laptop,Electrónica,1,12000,12000,Tarjeta de crédito,Ana Gómez
1,2,2025-02-06,Marta Díaz,Audífonos,Electrónica,2,850,1700,Efectivo,Roberto Torres
2,3,2025-03-06,Luis Méndez,Camiseta,Ropa,3,250,750,Transferencia,Lucía Romero
3,4,2025-03-06,Carmen Ruiz,Refrigerador,Electrodomésticos,1,9200,9200,Tarjeta de débito,Ana Gómez
4,5,2025-04-06,Pablo Ortiz,Tenis,Ropa,2,650,1300,Efectivo,Lucía Romero